import React from "react";

type Props = {};

export default function About({}: Props) {
  return (
    <div className="caseItem " style={{ height: 800, padding: 16 }}>
      <h1 className="text-4xl font-extrabold mb-2">
        在行业下行的浪潮之下主动辞职
      </h1>
      这个casepolice是我在决定辞职之后做的一个小玩具。
      当然它也是有点小作用，就是为了检查你的简历里面大小写拼写问题。
      灵感来源是我前几天在twitter上面看到的一个帖子，面试官在简历里面除了你的内容之外，很有可能因为你的大小写拼写对你的第一印象不太好。
      毕竟很多对代码有洁癖的人，都有这样的强迫症，比较严谨，正确的拼写看起来也比较舒服。
      现在是2023年3月17日，我是今年年初被裁员，接着过完农历新年之后，我通过朋友介绍光速加入了一个远程工作，但是是晚上上班需要倒时差。
      一开始我以为，时差什么的不是随便倒一倒就完事了，没想到的我的身体有了强烈的反应，尽管我每天两点就上床了，但是我一直到了凌晨4
      5点才能睡着，非常难受。
      早上七八点室友就会出门，有关门的声音，或者窗子外面有小孩出门家长大喊的声音，我就会暂时醒过来，接着迷迷糊糊的睡到中午十二点起来。
      脑袋像是浆糊一下先小晕一下，然后恢复到正常，起来眼睛和身体非常疲惫，我认为身体没有得到很好的休息。
      所以我在干了一个月之后，准备辞职了，身边所有人都让我考虑清楚，我的身体已经开始警告我了，薪资在大部分看起来非常不错，毕竟又是远程时间安排比较自由。
      但是晚上上班，时间并没有想象的那么舒服，由于违背了昼夜规律，导致你的身体适应新的休息时间非常缓慢，毕竟你养成了几十年的白天干活，晚上休息的规律，就这么容易就颠倒过来吗。
      倒夜班不是飞到一个不同的时区倒时差，不同的时区倒时差，倒完之后还是白天干活，晚上休息，身体自己会识别。
      最近AI的声浪越来越大，前端被替代的时间节点只会被提前，我时常在思考，不做前端我还能干什么？
      目前五年内我认为前端还有一席之地，当然只限中高级前端，现在入门前端已经死亡。
      前端不能只是前端，而是往全栈发展最好，JavaScript这个语言提供了非常好的全栈能力，NestJS可以写后端像写Spring一样，Next或者Nuxt更是把后端和Vue以及react结合在一起。
      也许是时候写点side
      project来做点产品，来营销自己，让更多人看到自己的实力，让我来工作也是一个非常不错的选择。
      对了还有Flutter，我认为是作为移动端跨平台唯一解，Ionic，RN我都用过，用起来都没有Flutter舒服。
      好了，这几天我要好好休息，白天写代码，晚上好好睡觉，实在不想熬夜了。
    </div>
  );
}
